import React from "react";

const AboutPage = () => {
  return (
    <div className="w-full bg-gray-50 mt-12">
      <div className="max-w-7xl mx-auto ">
        <div className="flex flex-col gap-y-8 p-24 ">
          <h1 className="text-md md:text-4xl font-semibold text-center text-[#001561]">
            Ассоциация представительств иностранных фармацевтических компаний и
            производителей в Республике Узбекистан
          </h1>

          <p className="text-xs md:text-lg text-center text-muted-foreground font-normal">
            Ташкентская Городская Ассоциация Представительств Иностранных
            Фармацевтических Компаний и Производителей является
            негосударственной некоммерческой организацией и представляет на
            рынке Узбекистана профессиональные и деловые интересы международных
            фармацевтических компаний-производителей оригинальных
            фармацевтических препаратов и медицинского оборудования. Основными
            целями и задачами ассоциации являются: содействие созданию открытого
            современного этического фармацевтического рынка в Республике
            Узбекистан; осуществление общественного контроля над соблюдением
            этических норм деятельности на фармацевтическом рынке; привлечение
            иностранных фирм-производителей для дальнейшего развития
            фармацевтической деятельности в Республике Узбекистан, участие в
            разработке целевых законодательных и нормативных проектов в области
            охраны здоровья и лекарственного обеспечения населения страны.
            Существенным также является сотрудничество и обмен информацией по
            вопросам здравоохранения с заинтересованными органами и
            учреждениями, международными научными и профессиональными
            организациями, организация правовой и другой необходимой поддержки.
            Ассоциация была создана в июле 2003 года, и настоящее время ее
            членами являются более 30 крупнейших фармацевтических компаний мира,
            имеющих в Республике Узбекистан аккредитованные представительства.
            Компании-члены Ассоциации контролируют большую долю мирового объема
            производства и продаж фармацевтической продукции. Благодаря своему
            медицинскому и научному опыту, они играют важную роль в снабжении
            Республики необходимой продукцией и способствуют обновлению научного
            и производственного потенциала нашей фармацевтической
            промышленности. Производя современные и высокоэффективные препараты,
            компании-члены Ассоциации дают возможность медицинскому сообществу и
            населению в целом, свободного доступа к самым современным
            фармацевтическим препаратам и медицинской продукции, имеющимся
            сегодня на мировом рынке. Мы надеемся, что наша Ассоциация в тесном
            сотрудничестве со всеми заинтересованными учреждениями внесет,
            несомненно, важный вклад по дальнейшей либерализации
            фармацевтического сектора и здравоохранения, что даст новое качество
            здоровью населения нашей Республики.
          </p>
        </div>
      </div>
    </div>
  );
};

export default AboutPage;
